<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"7bbed4005f4937151f049cd22ace1059dad6ec0168a54dbe6efcf3b7dcfc4cc8","plan_job_ref":"Job terraform-plan-04-aws-wireguard-vpn #148 at https://github.com/pipetail/terraform/actions/runs/22661094775","plan_out_hash":"f7c0d196c899f87a79228e53969733c1f54fd90e430975298cc5cf7394a22136","plan_hash":"559c26feecd1f0b233ffa288030320d43f50ade98690d1756a40e933c5635ba6","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan in __examples/04-aws-wireguard-vpn__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.wireguard_vpn.module.ec2_instance.aws_instance.this[0] will be created
+   resource "aws_instance" "this" {
+       ami                                  = "ami-05dff77713a4fa273"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       force_destroy                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = true
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_group_id                   = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       region                               = "eu-west-1"
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "************************"
+       tags                                 = {
+           "Name" = "wireguard-vpn"
        }
+       tags_all                             = {
+           "Name" = "wireguard-vpn"
        }
+       tenancy                              = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       volume_tags                          = {
+           "Name" = "wireguard-vpn"
        }
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       credit_specification {}

+       ebs_block_device (known after apply)

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device (known after apply)

+       instance_market_options (known after apply)

+       maintenance_options (known after apply)

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = "disabled"
+           http_put_response_hop_limit = 1
+           http_tokens                 = "********"
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface (known after apply)

+       primary_network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)

+       secondary_network_interface (known after apply)
    }

  # module.wireguard_vpn.module.ec2_instance.aws_security_group.this[0] will be created
+   resource "aws_security_group" "this" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "wireguard-vpn-"
+       owner_id               = (known after apply)
+       region                 = "eu-west-1"
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "wireguard-vpn"
        }
+       tags_all               = {
+           "Name" = "wireguard-vpn"
        }
+       vpc_id                 = "*********************"
    }

  # module.wireguard_vpn.module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv4_default"] will be created
+   resource "aws_vpc_security_group_egress_rule" "this" {
+       arn                    = (known after apply)
+       cidr_ipv4              = "0.0.0.0/0"
+       description            = "Allow all IPv4 traffic"
+       id                     = (known after apply)
+       ip_protocol            = "-1"
+       region                 = "eu-west-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags                   = {
+           "Name" = "wireguard-vpn-ipv4_default"
        }
+       tags_all               = {
+           "Name" = "wireguard-vpn-ipv4_default"
        }
    }

  # module.wireguard_vpn.module.ec2_instance.aws_vpc_security_group_egress_rule.this["ipv6_default"] will be created
+   resource "aws_vpc_security_group_egress_rule" "this" {
+       arn                    = (known after apply)
+       cidr_ipv6              = "::/0"
+       description            = "Allow all IPv6 traffic"
+       id                     = (known after apply)
+       ip_protocol            = "-1"
+       region                 = "eu-west-1"
+       security_group_id      = (known after apply)
+       security_group_rule_id = (known after apply)
+       tags                   = {
+           "Name" = "wireguard-vpn-ipv6_default"
        }
+       tags_all               = {
+           "Name" = "wireguard-vpn-ipv6_default"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   vpn_config    = (known after apply)

Warning: Deprecated attribute

  on /tmp/terraform-data-dir/modules/vpc/vpc-flow-logs.tf line 28, in locals:
  28:     "arn:${data.aws_partition.current[0].partition}:logs:${data.aws_region.current[0].name}:${data.aws_caller_identity.current[0].account_id}:log-group:${log_group.name}:*"

The attribute "name" is deprecated. Refer to the provider documentation for
details.
```
</details>

:memo: Plan generated in [terraform-plan-04-aws-wireguard-vpn #148](https://github.com/pipetail/terraform/actions/runs/22661094775)